<!-- @run-terraform -->
<!-- @run-terraform:start:sandbox -->
## Results for sandbox – ❗ `CHANGED` ❗
#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/42e5b8c9-32c2-4e0e-81cf-a34748721a1c/terraform-bin plan -input=false -no-color -detailed-exitcode -out=plan-sandbox.tfplan -var=image=ghcr.io/kartverket/skiperator-controller:sha-3ad437ad9eba704cbefb9b9090978dbf05d20fed -var-file=sandbox.tfvars
Acquiring state lock. This may take a few moments...

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # kubernetes_secret_v1.github_auth has been deleted
  - resource "kubernetes_secret_v1" "github_auth" {
        id                             = "skiperator-system/github-auth"
        # (4 unchanged attributes hidden)

      ~ metadata {
          - name             = "github-auth" -> null
            # (6 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # kubernetes_config_map.namespace-exclusions-map will be updated in-place
  ~ resource "kubernetes_config_map" "namespace-exclusions-map" {
      ~ data        = {
          - "istio-shipwreck"              = "true" -> null
            # (30 unchanged elements hidden)
        }
        id          = "skiperator-system/namespace-exclusions"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_deployment_v1.deployment will be updated in-place
  ~ resource "kubernetes_deployment_v1" "deployment" {
        id               = "skiperator-system/skiperator"
        # (1 unchanged attribute hidden)

      ~ spec {
            # (5 unchanged attributes hidden)

          ~ template {

              ~ spec {
                    # (12 unchanged attributes hidden)

                  ~ container {
                      ~ image                      = "ghcr.io/kartverket/skiperator-controller:sha-d800c4ece6ec54602bbd741e54bc766c01aef63e" -> "ghcr.io/kartverket/skiperator-controller:sha-3ad437ad9eba704cbefb9b9090978dbf05d20fed"
                        name                       = "skiperator"
                        # (8 unchanged attributes hidden)

                        # (7 unchanged blocks hidden)
                    }
                }

                # (1 unchanged block hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.cluster_role will be updated in-place
  ~ resource "kubernetes_manifest" "cluster_role" {
      ~ object   = {
          ~ metadata        = {
              ~ creationTimestamp          = null -> (known after apply)
                name                       = "skiperator"
                # (13 unchanged elements hidden)
            }
            # (4 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.custom_resource_definition will be updated in-place
  ~ resource "kubernetes_manifest" "custom_resource_definition" {
      ~ object   = {
          ~ metadata   = {
              ~ creationTimestamp          = null -> (known after apply)
                name                       = "applications.skiperator.kartverket.no"
                # (13 unchanged elements hidden)
            }
            # (3 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # kubernetes_secret_v1.github_auth will be created
  + resource "kubernetes_secret_v1" "github_auth" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = false

      + metadata {
          + generation       = (known after apply)
          + name             = "github-auth"
          + namespace        = "skiperator-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 4 to change, 0 to destroy.

Warning: "default_secret_name" is no longer applicable for Kubernetes v1.24.0 and above

  with kubernetes_service_account_v1.service_account,
  on role.tf line 1, in resource "kubernetes_service_account_v1" "service_account":
   1: resource "kubernetes_service_account_v1" "service_account" {

Starting from version 1.24.0 Kubernetes does not automatically generate a
token for service accounts, in this case, "default_secret_name" will be empty
```

</details>

#### Next action 🚀
Changes detected. Will run Terraform apply job on merge to 

*Pusher: @evenh, Working Directory: `deployment`, Commit: 3ad437ad9eba704cbefb9b9090978dbf05d20fed, Generated at: `26.2.2023, 22:36:23`*
<!-- @run-terraform:end:sandbox -->